{
  "id": 1606,
  "name": "Introduction",
  "body": "<center>![journey](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-1.jpg)</center>\r\n\r\n<br>\r\n\r\nWelcome to Bloc! You're about to embark on an exciting, challenging, and rewarding journey. You have enrolled in an immersive program that will push you to your limits, but fear not, you will have an abundance of support! In this checkpoint we'll explain the structure and expectations of the Bloc experience. Know that at its core, Bloc is about **mentorship**. When you become frustrated, discouraged, or want to throw your laptop against a wall, remember that you have a dedicated mentor who invests in your success. Let's review Bloc's key features to make sure you start on a productive track.\r\n\r\n### Your Time Commitment\r\n\r\n<center>![time](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-2.jpg)</center>\r\n\r\n<br>\r\n\r\nBloc is an immersive experience, and requires a serious time commitment. Students spend approximately 500 hours on Bloc assignments and projects before graduating. You'll achieve the best results with disciplined time management; review the following time commitments, based on your pace:\r\n\r\n| Weekly Appointments | Weekly Time Commitment |\r\n|-----------------|------------------------|\r\n| 3 | 40 hours |\r\n| 2 | 25 hours |\r\n| 1 | 15 hours |\r\n\r\nWe can't stress enough the importance of a disciplined schedule. Committing 15, 25, or 40 hours a week is no easy task. You'll  need to sacrifice TV, parties, video games, or even vacations. Remember that you'll maximize your results if you stay truly immersed throughout Bloc. You _must_ put in the time, or you will not achieve your desired results; there's too much to learn and build.\r\n\r\n### Curriculum\r\n\r\n<center>![writers](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-3.jpg)</center>\r\n\r\n<br>\r\n\r\nBloc has an entire team dedicated to the craft of curriculum development. Our curriculum is unique; it's built specifically for students and mentors to promote effective learning and collaboration. The curriculum is your roadmap through the Bloc experience; it defines the direction, topics, and sequence you'll need to learn and achieve your goals.\r\n\r\nThe curriculum consists of two phases: Foundation and Projects. Each phase contains checkpoints with explicit assignments that you must complete to progress to the next checkpoint. The Foundation Phase teaches fundamental skills through exercises and tutorialized projects. The Project Phase leverages the fundamentals learned in Foundation, and provides detailed specifications for projects that you'll build with your mentor. You should discuss each checkpoint with your mentor and resolve any questions you have before progressing. After submitting a checkpoint assignment, your mentor will review your work and provide you with feedback.\r\n\r\nThe curriculum is constantly assessed and improved. The technologies you're learning move fast, and thus, we must keep the curriculum current. We update the curriculum frequently, and will notify you when there are major changes.\r\n\r\nWe illustrate some tips for successful learning in the following video. We recommend that you come back to read this checkpoint and watch this video throughout Bloc:\r\n\r\n<center>\r\n  <iframe src=\"https://fast.wistia.net/embed/iframe/u53k9sb8uy\" allowtransparency=\"true\" frameborder=\"0\" scrolling=\"no\" class=\"wistia_embed\" name=\"wistia_embed\" allowfullscreen mozallowfullscreen webkitallowfullscreen oallowfullscreen msallowfullscreen width=\"100%\" height=\"300\"></iframe><script src=\"//fast.wistia.net/assets/external/E-v1.js\" async></script>\r\n</center>\r\n\r\n### Mentor Appointments\r\n\r\n<center>![appointment](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-4.jpg)</center>\r\n\r\n<br>\r\n\r\nAppointments are live, one-on-one meetings with your mentor. Each appointment is usually 30 minutes in length, though the actual duration will depend on the topic and your mentor's judgement.\r\n\r\nAppointments are virtual, and have software requirements:\r\n\r\n- [Google Chrome Web Browser](https://www.google.com/intl/en/chrome/browser/) - We think Chrome is the best browser for developers and designers, and we recommend using it in general.\r\n- __A screensharing application__ like [TeamViewer](https://www.teamviewer.com/en/download/currentversion.aspx) or Screenhero. Message your mentor to determine their preference, and download the software.\r\n- [Google Hangouts](https://www.google.com/hangouts/) or [Skype](https://www.skype.com) for video chat.\r\n\r\nIf you and your mentor prepare, have an agenda, and arrive on time, an appointment will be a high-leverage learning experience. Do not lose respect for your appointments; productive appointments are essential for a great experience. An appointment's agenda is not limited, but often includes:\r\n\r\n- checkpoint review\r\n- assignment review\r\n- project review\r\n- pair programming\r\n- code review\r\n- design critique\r\n- debugging and troubleshooting\r\n- best practice technique sharing\r\n\r\nYour mentor will often lead the appointment, but you should come with a list of questions and issues.\r\n\r\n### Communication\r\n\r\n<center>![communication](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-5.jpg)</center>\r\n\r\nMuch of your communication in Bloc will be asynchronous. You'll write a message, submit an assignment, or ask a question, and your mentor will respond. The recommended way to communicate asynchronously is to use our [messages feature](https://www.bloc.io/message_threads). You'll also have the ability to submit checkpoint-specific messages at the bottom of each checkpoint. (You'll see this in action below, in this checkpoint.)\r\n\r\nTo speak with someone at Bloc who is not your mentor, you can email [Bloc Help](mailto:help@bloc.io) anytime. You will **always** have someone to speak with at Bloc, no matter what the issue is.\r\n\r\nYou will establish other means of communication with your mentor, based on your mutual preferences. We encourage you to use the Bloc messages feature as much as possible, but realize that other communication tools may sometimes be necessary. The following section lists some alternative communication tools.\r\n\r\n### Ecosystem\r\n\r\nBloc's ecosystem includes tools that make it easier to collaborate and get help when you need it. The ecosystem is always evolving, and you should explore its tools. Review the [Ecosystem resource](https://www.bloc.io/resources/ecosystem) and ask your mentor which tools they use.\r\n\r\n### Expectations\r\n\r\n<center>![mentor-apprentice](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-6.jpg)</center>\r\n\r\n<br>\r\n\r\nYour expectations must align with your mentor's to be successful in Bloc. It's important to understand what's expected of you, and what you should expect of your mentor.\r\n\r\n### Mentor Expectations\r\n\r\nMentors will:\r\n\r\n* Inspire and lead students.\r\n* Prepare for appointments and arrive on time.\r\n* Hold students accountable.\r\n* Respond to all questions and issues.\r\n* Provide feedback on submitted checkpoints and assignments.\r\n\r\n### Student Expectations\r\n\r\nStudents will:\r\n\r\n* Commit the requisite time to Bloc.\r\n* Trust their mentor.\r\n* Accept the assignments and projects provided by Bloc.\r\n* Prepare for appointments and arrive on time.\r\n* Communicate openly with their mentor.\r\n\r\n### Succeeding in Bloc and Beyond\r\n\r\n<center>![success](https://bloc-global-assets.s3.amazonaws.com/images-misc/intro-cp/IntroCP-7.jpg)</center>\r\n\r\n<br>\r\n\r\nMaintaining a healthy perspective on yourself and your work is crucial for getting a job, starting a company, building a product, or winning client work. Students who excel portray the following traits:\r\n\r\n* I am responsible for my own learning.\r\n* I embrace challenges.\r\n* I am focused and disciplined.\r\n* I share what I learn with the Bloc community.\r\n* I celebrate accomplishments.",
  "parent_id": null,
  "created_at": "2015-08-06T20:26:24.471Z",
  "updated_at": "2016-02-24T03:41:30.024Z",
  "assignment": "Introduce yourself to your mentor by completing the following tasks:\r\n\r\n1. Upload a photo of yourself to your Bloc account.\r\n2. Complete your account and bio in Bloc.\r\n3. Briefly review [`Markdown`](http://guides.github.com/overviews/mastering-markdown/) syntax. You don't have to memorize all the syntax now, and you can certainly ask your mentor about common Markdown idioms. Try to get a feel for some of the basic syntax, like headings, links and code blocks.\r\n4. Send your mentor a Bloc message using some simple Markdown, and share something about yourself. For example, \"what inspired you to join Bloc?\" or \"what's the most valuable lesson you've learned in life?\".\r\n5. Find your mentor on Slack and send them a direct message. Also, introduce yourself to your course Slack channel.\r\n6. Write a list of goals in a message that you hope to achieve during Bloc. Discuss these goals with your mentor during your first meeting.",
  "summary": "Welcome to Bloc: learn about the experience, your mentor, the curriculum, and expectations",
  "points": 1,
  "project_name": "",
  "roadmap_id": 8,
  "active": true,
  "job_prep": false,
  "version": [
    0,
    0
  ],
  "body_file_path": "",
  "uuid": "4a9025af-2528-471a-bbeb-65a0e266b2f6",
  "ref": "4a9025af-2528-471a-bbeb-65a0e266b2f6|0",
  "retroactive_optional_date": null,
  "checkpoint_type": "normal"
}